In [1]:
import pandas as pd
import pyarrow
import openpyxl

In [2]:
df1=pd.read_csv(r"C:\PythonWorkshop\wsbpythonfiles\Zadania\ZadaniaDf1.csv"
               ,sep="/"
               )
df2=pd.read_parquet(r"C:\PythonWorkshop\wsbpythonfiles\Zadania\ZadaniaDf2.parquet"
                   ,use_nullable_dtypes=True
                   ,engine="pyarrow")
df3=pd.read_csv(r"C:\PythonWorkshop\wsbpythonfiles\Zadania\ZadaniaDf3.txt"
               ,sep=" ")
df4=pd.read_excel(r"C:\PythonWorkshop\wsbpythonfiles\Zadania\ZadaniaDf4.xlsx")

C:\Users\sqladmin\AppData\Local\Temp\2\ipykernel_8024\962080886.py:4: FutureWarning: The argument 'use_nullable_dtypes' is deprecated and will be removed in a future version.Use dtype_backend='numpy_nullable' instead of use_nullable_dtype=True.
  df2=pd.read_parquet(r"C:\PythonWorkshop\wsbpythonfiles\Zadania\ZadaniaDf2.parquet"

In [3]:
df4.head()

        City     Zone
0  Stockholm   Europe
1     Denver  America
2     Moscow     Asia
3  Marseille   Europe
4    Palermo   Europe

In [4]:
print(df1.info(show_counts=True))
print(df2.info(show_counts=True))
print(df3.info(show_counts=True))
print(df4.info(show_counts=True))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000000 entries, 0 to 4999999
Data columns (total 10 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   Invoice_Id       5000000 non-null  object
 1   account_name     4772470 non-null  object
 2   account_surname  4231219 non-null  object
 3   age              5000000 non-null  int64
 4   product          4443677 non-null  object
 5   order_city       4688008 non-null  object
 6   color            5000000 non-null  object
 7   date             5000000 non-null  object
 8   delivery_date    5000000 non-null  object
 9   production_date  5000000 non-null  int64
dtypes: int64(2), object(8)
memory usage: 381.5+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000000 entries, 0 to 4999999
Data columns (total 9 columns):
 #   Column                    Non-Null Count    Dtype
---  ------                    --------------    -----
 0   account_name              5000000 non-null  object
 1   account_surname           5000000 non-null  object
 2   Invoice_Id                5000000 non-null  object
 3   discount                  5000000 non-null  object
 4   ordered                   5000000 non-null  int32
 5   quantity                  5000000 non-null  int32
 6   region                    5000000 non-null  object
 7   additional_delivery_cost  5000000 non-null  object
 8   wrh_city                  5000000 non-null  object
dtypes: int32(2), object(7)
memory usage: 305.2+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000000 entries, 0 to 4999999
Data columns (total 8 columns):
 #   Column                    Non-Null Count    Dtype
---  ------                    --------------    -----
 0   Invoice_Id                5000000 non-null  object
 1   discount                  3999612 non-null  float64
 2   ordered                   5000000 non-null  int64
 3   quantity                  5000000 non-null  int64
 4   region                    0 non-null        float64
 5   additional_delivery_cost  5000000 non-null  object
 6   wrh_city                  5000000 non-null  object
 7   price                     5000000 non-null  int64
dtypes: float64(2), int64(3), object(3)
memory usage: 305.2+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   City    15 non-null     object
 1   Zone    15 non-null     object
dtypes: object(2)
memory usage: 372.0+ bytes
None

In [5]:
df1.head()

,Invoice_Id,account_name,account_surname,age,product,order_city,color,date,delivery_date,production_date
0,Invoice: 1A,Patricia,Old_Clifford,28,NaN,Stockholm,black,2014-09-10,2014-09-25,20140908
1,Invoice: 2A,John,Luciano,31,Prod C,Palermo,orange,2010-11-29,2010-11-30,20101125
2,Invoice: 3A,Elizabeth,Clifford,32,NaN,Nairobi,indigo,2010-05-30,2010-06-09,20100529
3,Invoice: 4A,Robert,Vallllentine,25,Prod D,NaN,green,2017-02-01,2017-02-05,20170129
4,Invoice: 5A,patricia,Peroni,47,Prod A,Marseille,orange,2017-01-29,2017-02-13,20170127

In [6]:
df1.duplicated().sum()

0

In [7]:
df1.duplicated(subset=["Invoice_Id","account_name","account_surname","age","order_city"]).sum()

0

In [8]:
df1.isnull().sum()

Invoice_Id              0
account_name       227530
account_surname    768781
age                     0
product            556323
order_city         311992
color                   0
date                    0
delivery_date           0
production_date         0
dtype: int64

In [9]:
df2.sample(5)

,account_name,account_surname,Invoice_Id,discount,ordered,quantity,region,additional_delivery_cost,wrh_city
3123787,MarY,Robust,Invoice: 3123788A,0.3,97,95,,TC,Krakow_Manila
533391,james,,Invoice: 533392A,0.4,26,17,,T,Warsaw_Madrid
3108830,Robert,,Invoice: 3108831A,,75,61,,TC,Poznan_Milwaukee
2556095,William,Clifford,Invoice: 2556096A,0.2,95,76,,TC,Warsaw_Manila
586149,Linda,Robust,Invoice: 586150A,0.2,28,28,,T,Poznan_Palermo

In [10]:
df2.duplicated(subset="Invoice_Id").sum()

0

In [11]:
df2.isnull().sum()

account_name                0
account_surname             0
Invoice_Id                  0
discount                    0
ordered                     0
quantity                    0
region                      0
additional_delivery_cost    0
wrh_city                    0
dtype: int64

In [12]:
df3.sample(5)

,Invoice_Id,discount,ordered,quantity,region,additional_delivery_cost,wrh_city,price
1177629,Invoice: 1177630A,0.1,35,28,NaN,T,Poznan_Oslo,5
1511205,Invoice: 1511206A,NaN,75,70,NaN,T,Warsaw_Madrid,9
2879753,Invoice: 2879754A,0.2,73,59,NaN,T,Wroclaw_Palermo,7
1431420,Invoice: 1431421A,NaN,47,41,NaN,T,Warsaw_Lisbon,9
1276566,Invoice: 1276567A,0.3,29,15,NaN,T,Wroclaw_Madrid,9

In [13]:
df3.duplicated(subset="Invoice_Id").sum()

0

In [14]:
df4.sample(5)

              City     Zone
8          Nairobi   Africa
9   Río de Janeiro  America
14       Milwaukee  America
2           Moscow     Asia
1           Denver  America

In [15]:
df4.duplicated().sum()

0

In [16]:
df1.sample()

,Invoice_Id,account_name,account_surname,age,product,order_city,color,date,delivery_date,production_date
823425,Invoice: 823426A,Elizabeth,Hawkins,48,Prod D,Madrid,red,2011-02-02,2011-02-04,20110127

In [17]:
df2.sample()

,account_name,account_surname,Invoice_Id,discount,ordered,quantity,region,additional_delivery_cost,wrh_city
2884661,Jennifer,Robust,Invoice: 2884662A,0.2,43,42,,T,Poznan_Oslo

In [18]:
df2.columns

Index(['account_name', 'account_surname', 'Invoice_Id', 'discount', 'ordered',
       'quantity', 'region', 'additional_delivery_cost', 'wrh_city'],
      dtype='object')

In [19]:
u_df1_df2 = df1.merge(right=df2,how="outer",right_on="Invoice_Id",left_on="Invoice_Id")

In [20]:
#"Invoice_Id", "discount", "ordered" ,"quantity", "region", "additional_delivery_cost", "wrh_city"
u_df1_df2 = df1.merge(
    right=df2[["Invoice_Id", "discount", "ordered" ,"quantity", "region", "additional_delivery_cost", "wrh_city"]]
    ,how="outer",right_on="Invoice_Id",left_on="Invoice_Id")

In [22]:
df3.sample(5)

,Invoice_Id,discount,ordered,quantity,region,additional_delivery_cost,wrh_city,price
4570351,Invoice: 4570352A,NaN,95,89,NaN,T,Krakow_Lisbon,9
4717903,Invoice: 4717904A,NaN,11,-2,NaN,T,Poznan_Lisbon,9
4905408,Invoice: 4905409A,0.1,50,42,NaN,T,Poznan_Stockholm,9
103521,Invoice: 103522A,0.3,67,67,NaN,T,Poznan_Marseille,5
3014733,Invoice: 3014734A,0.4,14,14,NaN,T,Wroclaw_Oslo,7

In [21]:
u_df1_df2.sample(5)

,Invoice_Id,account_name,account_surname,age,product,order_city,color,date,delivery_date,production_date,discount,ordered,quantity,region,additional_delivery_cost,wrh_city
4661832,Invoice: 4661833A,Richard,Peroni,390,Prod D,Milwaukee,beige,2012-10-22,2012-11-02,20121014,,67,50,,TC,Warsaw_Milwaukee
2375175,Invoice: 2375176A,james,NaN,43,Prod H,Madrid,indigo,2010-06-29,2010-07-01,20100616,,25,18,,T,Krakow_Madrid
725310,Invoice: 725311A,Elizabeth,Luciano,57,Prod G,Berlin,yellow,2018-01-26,2018-02-03,20180122,0.4,72,60,,T,Warsaw_Berlin
3685201,Invoice: 3685202A,Michael,Clifford,58,Prod H,Oslo,red,2016-04-23,2016-05-06,20160420,,47,39,,T,Wroclaw_Oslo
2595362,Invoice: 2595363A,Juan Luis,Luciano,27,Prod D,Marseille,blue,2013-01-03,2013-01-11,20121231,0.1,38,24,,T,Krakow_Marseille

In [23]:
u_df1_2_3 = u_df1_df2.merge(right=df3,how="left",right_on="Invoice_Id",left_on="Invoice_Id")

In [26]:
u_df1_2_3.sample(5)

,Invoice_Id,account_name,account_surname,age,product,order_city,color,date,delivery_date,production_date,...,region_x,additional_delivery_cost_x,wrh_city_x,discount_y,ordered_y,quantity_y,region_y,additional_delivery_cost_y,wrh_city_y,price
4089289,Invoice: 4089290A,NaN,Vallentine,64,Prod B,Tokyo,indigo,2010-03-09,2010-03-09,20100301,...,,TF,Warsaw_Tokyo,0.1,78,68,NaN,TF,Warsaw_Tokyo,5
1025457,Invoice: 1025458A,Ahmed,Vallllentine,46,Prod D,Tokyo,pink,2015-08-08,2015-08-12,20150805,...,,TF,Warsaw_Tokyo,0.4,97,97,NaN,TF,Warsaw_Tokyo,7
3790641,Invoice: 3790642A,Patricia,Robust,52,Prod G,Denver,gold,2013-12-02,2013-12-19,20131125,...,,TC,Warsaw_Denver,0.4,90,90,NaN,TC,Warsaw_Denver,9
3655866,Invoice: 3655867A,James,Old_Clifford,530,Prod G,Lisbon,orange,2011-06-22,2011-06-28,20110614,...,,T,Krakow_Lisbon,NaN,74,64,NaN,T,Krakow_Lisbon,9
3299576,Invoice: 3299577A,MarY,NaN,450,Prod A,Manila,grey,2015-02-26,2015-03-08,20150213,...,,TC,Krakow_Manila,NaN,98,95,NaN,TC,Krakow_Manila,5

In [28]:
u_df123 = u_df1_df2.merge(df3[["price","region"]],how="left",right_on="Invoice_Id",left_on="Invoice_Id")

KeyError: 'Invoice_Id'

In [30]:
u_df3 = df3[["Invoice_Id","price"]]

In [31]:
u_df3.sample(5)

                Invoice_Id  price
1612        Invoice: 1613A      9
208007    Invoice: 208008A      9
2423790  Invoice: 2423791A      9
3514276  Invoice: 3514277A      7
4500338  Invoice: 4500339A      9

In [32]:
u_df123 = u_df1_df2.merge(right=u_df3,how="left",right_on="Invoice_Id",left_on="Invoice_Id")

In [38]:
u_df123.sample(5)

,Invoice_Id,account_name,account_surname,age,product,order_city,color,date,delivery_date,production_date,discount,ordered,quantity,region,additional_delivery_cost,wrh_city,price
3073168,Invoice: 3073169A,RobeRT,Robust,43,Prod F,Moscow,brown,2017-07-04,2017-07-11,20170629,0.1,21,6,,T,Wroclaw_Moscow,9
2473851,Invoice: 2473852A,Barbara,Luciano,440,Prod E,Marseille,silver,2014-03-22,2014-04-11,20140321,,66,48,,T,Krakow_Marseille,9
569225,Invoice: 569226A,Barbara,Nici,60,Prod C,Lisbon,black,2016-11-18,2016-12-08,20161111,,28,9,,T,Wroclaw_Lisbon,7
1030101,Invoice: 1030102A,NaN,Peroni,30,Prod F,Moscow,indigo,2010-10-17,2010-10-29,20101012,0.2,68,63,,T,Krakow_Moscow,9
4898672,Invoice: 4898673A,James,Old_Clifford,63,NaN,Río de Janeiro,beige,2014-12-29,2014-12-29,20141220,0.2,51,48,,TC,Wroclaw_Río de Janeiro,99

In [36]:
df4

              City     Zone
0        Stockholm   Europe
1           Denver  America
2           Moscow     Asia
3        Marseille   Europe
4          Palermo   Europe
5            Tokyo     Asia
6           Lisbon   Europe
7             Oslo   Europe
8          Nairobi   Africa
9   Río de Janeiro  America
10          Berlin   Europe
11          Bogotá  America
12          Manila     Asia
13          Madrid   Europe
14       Milwaukee  America

In [39]:
u_df1234=u_df123.merge(right=df4,how="left",left_on="order_city",right_on="City")

In [41]:
u_df1234.sample(5)

,Invoice_Id,account_name,account_surname,age,product,order_city,color,date,delivery_date,production_date,discount,ordered,quantity,region,additional_delivery_cost,wrh_city,price,City,Zone
4025639,Invoice: 4025640A,JohN,Vallllentine,46,NaN,Moscow,beige,2017-04-10,2017-04-29,20170402,0.3,31,30,,T,Wroclaw_Moscow,99,Moscow,Asia
4163946,Invoice: 4163947A,Salomon,Luciano,380,Prod C,Denver,silver,2017-01-21,2017-02-09,20170113,0.3,60,45,,TC,Poznan_Denver,7,Denver,America
4774814,Invoice: 4774815A,Barbara,Hawkins,45,Prod D,NaN,red,2014-09-27,2014-09-29,20140919,0.1,77,77,,?,Poznan_,7,NaN,NaN
4704850,Invoice: 4704851A,Juan Luis,Robust,480,Prod D,Moscow,green,2012-08-11,2012-08-29,20120804,,27,24,,T,Poznan_Moscow,7,Moscow,Asia
4682800,Invoice: 4682801A,MarY,NaN,55,Prod H,Manila,blue,2010-09-28,2010-10-01,20100920,0.4,70,60,,TC,Poznan_Manila,9,Manila,Asia

In [43]:
merge_df = u_df1234.drop(columns=["City"])

In [46]:
merge_df.sample(5)

,Invoice_Id,account_name,account_surname,age,product,order_city,color,date,delivery_date,production_date,discount,ordered,quantity,region,additional_delivery_cost,wrh_city,price,Zone
2102241,Invoice: 2102242A,Mary,NaN,57,Prod G,Lisbon,black,2014-06-22,2014-07-11,20140615,,53,52,,T,Krakow_Lisbon,9,Europe
369033,Invoice: 369034A,Jennifer,Luciano,54,Prod B,Oslo,grey,2013-05-02,2013-05-15,20130426,0.2,67,63,,T,Krakow_Oslo,5,Europe
4942709,Invoice: 4942710A,JohN,Ellen,58,NaN,Lisbon,gold,2011-04-22,2011-05-04,20110419,0.2,66,51,,T,Warsaw_Lisbon,99,Europe
1747963,Invoice: 1747964A,Richard,Luciano,36,Prod E,Nairobi,green,2012-01-02,2012-01-15,20111229,0.2,43,25,,TF,Wroclaw_Nairobi,9,Africa
2895638,Invoice: 2895639A,Susan,Vallllentine,44,Prod E,Milwaukee,silver,2016-09-06,2016-09-24,20160903,0.4,55,41,,TC,Wroclaw_Milwaukee,9,America

In [47]:
merge_df.to_csv(path_or_buf=r"C:\PythonWorkshop\wsbpythonfiles\Zajecia\merge_df.csv"
           ,mode="w"
           ,index=True
           ,sep="|")

merge_df = pd.read_csv(r"C:\PythonWorkshop\wsbpythonfiles\Zajecia\merge_df.csv")